Tekla Open API Reference for Tekla Structures 2025
Distance Constructor (Double)
 Initializes a new instance of the structure.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Distance(
	double millimeters
)
Public Sub New (
	millimeters As Double
)
Parameters
millimeters
Type: System.Double
The distance in millimeters.
Examples
 This example shows how to construct a new Distance instance.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance distance = new Distance(30.2);
       }
}
See Also
Reference
Distance Structure
Distance Overload
Tekla.Structures.Datatype Namespace